[
  {
    "title": "I just got back from my first trip to your beautiful city",
    "url": "https://www.reddit.com/r/MexicoCity/comments/14sekc5/i_just_got_back_from_my_first_trip_to_your/",
    "score": 1230,
    "created_utc": "2023-07-06T11:38:59",
    "subreddit": "MexicoCity",
    "text": "I just wanted to say how much I loved it. We ate amazing food and enjoyed how beautiful the city was. We visited the castle, anthropology museum, the teotihuacan pyramids. We tried pulque and ate our body weight in al pastor tacos. We tried the churros at el moro and we ate at Pujol.  We basically tried to mimic some of the Mexico City food episodes we saw on Netflix. \n\nWe went to see the templo mayor and got completely trapped by closed roads due to a presidential parade? It was wild.  \n\nWe tri",
    "num_comments": 198
  },
  {
    "title": "in today's New York Times, Mexico City is recommended as one of five family-friendly cities to visit this spring",
    "url": "https://www.reddit.com/gallery/1ivkzct",
    "score": 474,
    "created_utc": "2025-02-22T09:19:12",
    "subreddit": "MexicoCity",
    "text": "",
    "num_comments": 87
  },
  {
    "title": "Just returned from 9 day solo trip to Mexico City. Wow!",
    "url": "https://www.reddit.com/r/MexicoCity/comments/u4psy0/just_returned_from_9_day_solo_trip_to_mexico_city/",
    "score": 353,
    "created_utc": "2022-04-15T23:20:10",
    "subreddit": "MexicoCity",
    "text": "My visit to Ciudad de Mexico was absolutely amazing! I am blown away by how dynamic and diverse the city is and I cannot wait to return. I did most of the major tourist attractions, took subways and buses everywhere, and ate street food and at market cocinas for most meals. The food was amazing everywhere!\n\nAs a New Yorker, I was pleasantly surprised at how clean the city was despite the dearth of trash cans. It was really difficult to find trash cans! And while the city is definitely fast paced",
    "num_comments": 126
  },
  {
    "title": "Advice: Learn some Spanish before you visit",
    "url": "https://www.reddit.com/r/MexicoCity/comments/1g3ozq0/advice_learn_some_spanish_before_you_visit/",
    "score": 264,
    "created_utc": "2024-10-14T14:51:43",
    "subreddit": "MexicoCity",
    "text": "I just left Mexico City after a week there. It was an amazing experience and the people are kind and open. \n\nI would definitely recommend anyone considering a trip there to learn some basic Spanish, even if it’s just basic greetings or expressions for ordering food and getting places or to the restroom. \n\nI speak Spanish maybe at an advanced beginner or intermediate level (A2 or B1) and I use it occasionally in my daily life or at work as I live in a large city with a large population of bilingu",
    "num_comments": 103
  },
  {
    "title": "Just came back from 9 days in cdmx. Here is my honest review of the restaurants I went to.",
    "url": "https://www.reddit.com/r/MexicoCity/comments/1hqwlmw/just_came_back_from_9_days_in_cdmx_here_is_my/",
    "score": 101,
    "created_utc": "2024-12-31T23:36:38",
    "subreddit": "MexicoCity",
    "text": "Just came back from 9 days here. I did a ton of research on food prior, as I have a 2 yr old son so I couldn’t just wing it. My wife and I are big foodies, can handle spice and variety of flavors and like to think we have pretty decent palette for quality cuisine.\n\nThe food I tried definitely skewed towards less street food and more restaurants with reservations and small shops, due to hesitation of my kid or us getting sick.\n\nBut that said, here are my ratings out of 10 from my 1st day to last:",
    "num_comments": 204
  },
  {
    "title": "Is Pujol worth the money? Restaurante “Pujol” vale la pena, o no?)",
    "url": "https://www.reddit.com/r/MexicoCity/comments/pnlyow/is_pujol_worth_the_money_restaurante_pujol_vale/",
    "score": 94,
    "created_utc": "2021-09-13T14:00:46",
    "subreddit": "MexicoCity",
    "text": "Spanish: (translated) \n\nNunca he estado en un restaurante realmente elegante.  Pensé que podría encontrar uno bueno en CDMX, y Pujol aparece en todas las guías.  Se ve increíble, pero todavía cuesta $ 1,860 por persona, lo cual es muy caro para mí.  ¿Vale la pena el dinero o puedo ir a un lugar mejor por el costo?  Lo siento si ya se ha hecho esta pregunta antes, miré a través del sub, pero no vi nada específico sobre este restaurante.  Cualquier recomendación sería apreciada, por mucho que me e",
    "num_comments": 113
  },
  {
    "title": "1 month in Mexico---is Roma really the best choice?",
    "url": "https://www.reddit.com/r/MexicoCity/comments/skk0ln/1_month_in_mexicois_roma_really_the_best_choice/",
    "score": 91,
    "created_utc": "2022-02-04T12:07:00",
    "subreddit": "MexicoCity",
    "text": "We are two middle-aged queer women, both experienced international travelers, planning a month in Mexico City this spring.  Every single person we have talked to has said \"stay in Roma!\" (or Roma/Condessa).\n\nBut I'm a little worried that the neighborhood will be full of expats and tourists and few locals. Is that true? Is there real street food or just hipster cafes and pricy restaurants? Looking forward to inexpensive jugos and liquados, tacos, etc. Will people switch to English as soon as they",
    "num_comments": 185
  },
  {
    "title": "Changes to Mexico Tourist Screening and Visa On Arrival Warning",
    "url": "https://www.reddit.com/r/MexicoCity/comments/qm3911/changes_to_mexico_tourist_screening_and_visa_on/",
    "score": 90,
    "created_utc": "2021-11-03T15:19:16",
    "subreddit": "MexicoCity",
    "text": "In September 2021, my boyfriend and I booked flights to go on a trip to Latin America to reunite and travel together. Previously, we had only seen each other in person for a week back in 2019 but have kept in contact for more than 2 years through messaging and video calls. In July 2021, we decided to begin a relationship upon our reunion. Initially, we decided for him to come to Ukraine but later decided on Mexico as a beautiful, warm and friendly destination to finally see each other in late Oc",
    "num_comments": 64
  },
  {
    "title": "CDMX places to visit: overrated, properly rated, underrated",
    "url": "https://www.reddit.com/r/MexicoCity/comments/1aevsl3/cdmx_places_to_visit_overrated_properly_rated/",
    "score": 89,
    "created_utc": "2024-01-30T12:42:02",
    "subreddit": "MexicoCity",
    "text": "I’m a big fan of lists and rankings, so I thought I’d give this a go. I’d love to see your responses as well.\n\n—Overrated—\n•Cafe el Pendulo - not awful, but I recommend finding indecently owned coffee shops and bookstores\n\n\n—Properly Rated—\n•Anthropology Museum - lives up to the hype\n\n•Zocalo - nothing like this in other major world cities, IMO. Its size is impressive.\n\n•Teotihuacan Pyramids - lives up the hype; the many vendors selling chotchkis is a bit of a turn-off, but oh well, we all gotta",
    "num_comments": 71
  },
  {
    "title": "Extorted by Police",
    "url": "https://www.reddit.com/r/MexicoCity/comments/1f3s9dk/extorted_by_police/",
    "score": 66,
    "created_utc": "2024-08-28T22:01:05",
    "subreddit": "MexicoCity",
    "text": "I have been in Mexico City since August 22nd and have had such an amazing time exploring this beautiful city. The food has been amazing, the museums have been beautiful, the architecture is awesome, and above all the people have been so friendly and kind. This has been a spectacular trip thus far and I have enjoyed almost every moment of it.\n\nHowever, last night, four friends and I were getting drinks at a bar on avenida Alvaro Obregón (a very busy street). After finishing drinking, me and three",
    "num_comments": 130
  },
  {
    "title": "We visited from Berlin and had some thoughts on the city + recommendations for fellow Europeans",
    "url": "https://www.reddit.com/r/MexicoCity/comments/18km223/we_visited_from_berlin_and_had_some_thoughts_on/",
    "score": 52,
    "created_utc": "2023-12-17T11:16:03",
    "subreddit": "MexicoCity",
    "text": "If anyone cares, I'm from the Balkans but live in Berlin with my wife and we just spent like 5 days in mexico City.\n\nPrices: grocery prices and alcohol are both much more expensive than both Germany and the Balkans, we were shocked. We loved the food markets though but couldn't help but notice how expensive the regular grocery shops were. Not sure how people afford this stuff (at least on what we assume is regular consumption levels).\n\nSafety: we didn't have anything happen to us nor did we witn",
    "num_comments": 286
  },
  {
    "title": "Looking for interesting/unique bars and restaurants",
    "url": "https://www.reddit.com/r/MexicoCity/comments/qw431g/looking_for_interestingunique_bars_and_restaurants/",
    "score": 49,
    "created_utc": "2021-11-17T11:17:59",
    "subreddit": "MexicoCity",
    "text": "My wife and I are heading to Mexico City next week to just check out bars and restaurants and maybe a few museums or lucha libre. \n\nI'm looking for unique and different bars or restaurants that we can go to. Every google search just gives me the BEST 69 restaurants or something. We like good food/drinks, but a creative hole-in-the-wall is far more interesting. \n\nFor example, in Denver we have some speakeasies or places like this bar built onto the outside: https://www.google.com/search?q=forest+",
    "num_comments": 53
  },
  {
    "title": "Contramar fakery, Rosetta, Azul worth the meal?",
    "url": "https://www.reddit.com/r/MexicoCity/comments/196raly/contramar_fakery_rosetta_azul_worth_the_meal/",
    "score": 39,
    "created_utc": "2024-01-14T15:49:57",
    "subreddit": "MexicoCity",
    "text": "UPDATE BELOW/ Headed to CDMX in Feb and really looking forward to a mix of local street and fine(r) dining. Seeing the latest reviews on Contramar (50+ obviously fake reviews in the last 25 hrs) I’m now not sure it’s a good use of a lunch when there are so many exciting things to eat.  \n\nMasala Y Maiz is on the itinerary, + Ticuchi, Rosetta, Azul Historico, Taqueria Orinoco, El Cardenal, Campobaja, El Gran Ababnico, Coox Hanal… \n\nReviews are borderline useless to go by these days. Would apprecia",
    "num_comments": 165
  },
  {
    "title": "Everyone is invited to the largest traditional mexican music event in CDMX, starting today.",
    "url": "https://i.redd.it/o3472kcjqnk11.jpg",
    "score": 13,
    "created_utc": "2018-09-06T12:59:56",
    "subreddit": "MexicoCity",
    "text": "",
    "num_comments": 5
  },
  {
    "title": "gastronomic highlights",
    "url": "https://www.reddit.com/r/MexicoCity/comments/mt6bnx/gastronomic_highlights/",
    "score": 11,
    "created_utc": "2021-04-17T23:47:07",
    "subreddit": "MexicoCity",
    "text": "hello friends, i'm being sent to cdmx for a few days. would rather not travel but i'd rather keep my job\n\nmainly interested in the best there is so i've looked at bourdain and mark wiens and also looked through this sub for similar posts. i am a food snob plus will only be here for a short while so i'm looking for quality whether its a street vendor, hole in the wall, or michelin tier restaurants\n\nthis is what i have so far for dinner: pujol, Quintonil, Sud 777, Garum, and Maximo Bistrot.  Roset",
    "num_comments": 28
  },
  {
    "title": "Tacos al Pastor de Chivo",
    "url": "https://www.reddit.com/gallery/13f9e9y",
    "score": 11,
    "created_utc": "2023-05-11T22:30:07",
    "subreddit": "CDMX",
    "text": "",
    "num_comments": 6
  },
  {
    "title": "Dad's 70th Birthday in Mexico City - he's a big vibes guy ",
    "url": "https://www.reddit.com/r/MexicoCity/comments/1hqhmk4/dads_70th_birthday_in_mexico_city_hes_a_big_vibes/",
    "score": 8,
    "created_utc": "2024-12-31T10:00:03",
    "subreddit": "MexicoCity",
    "text": "Hi! White, American question warning! Taking my parents to the City for my Dad's 70th (his hobbies include turning garage into a \"trance/house music lounge\", doing drag and he is a history NERD. We're staying in Polanco. Doing the usual museum round up - was curious if anyone had a plug for a good private guide for the Anthro museum? Food wise here's my tentative list - looking for any suggestions/things you'd change. He is big vibes guy so trying to bring it. \n\nEntremar - Dinner Thursday after ",
    "num_comments": 59
  },
  {
    "title": "Visiting CDMX in two weeks.",
    "url": "https://www.reddit.com/r/MexicoCity/comments/o20fqe/visiting_cdmx_in_two_weeks/",
    "score": 8,
    "created_utc": "2021-06-17T10:50:10",
    "subreddit": "MexicoCity",
    "text": "my friend and I are visiting CDMX for 5 days next weekend. We have the parks and museums down but are having a hard time finding other things to do (going out / food spots). \n\nWe’re staying in Roma and already have a reservation at Pujols. We’re two young active professionals (30s) looking for great hole in the wall foods (any non fine-dining will work) and lively places to go out, grab drinks and meet people. Or if there’s any other activities recommended, lmk! Any off the beaten path recommend",
    "num_comments": 11
  },
  {
    "title": "MEXICAN FOOD COOKING CLASS/TOUR?",
    "url": "https://www.reddit.com/r/MexicoCity/comments/5osmr2/mexican_food_cooking_classtour/",
    "score": 7,
    "created_utc": "2017-01-18T16:30:09",
    "subreddit": "MexicoCity",
    "text": "Hi everyone, my brother and his girlfriend will be visiting me here in DF and they want to do a (one-time) cooking class/tour to learn some traditional Mexican dishes. Has anyone done something like this/have recommendations? Gracias. ",
    "num_comments": 3
  },
  {
    "title": "Things to do in July (especially when it rains) for ten adults",
    "url": "https://www.reddit.com/r/MexicoCity/comments/1dysmma/things_to_do_in_july_especially_when_it_rains_for/",
    "score": 7,
    "created_utc": "2024-07-08T22:38:32",
    "subreddit": "MexicoCity",
    "text": "My friends and I are heading to Mexico City this coming weekend for a 40th birthday celebration (5 guys + 5 gals).  What are some unique and fun things to do in the city (especially when it rains)?  We didn't expect it to rain this much... so any suggestions would be greatly appreciated.  We like good food, good drinks, music, and unique experiences so any suggestions would be greatly appreciated!\n\n  \ndive bars, jazz bars, hole in the wall food spots, things to do, cooking classes, salsa classes",
    "num_comments": 26
  },
  {
    "title": "Should I stay in Mexico City for my whole 3 week trip? ",
    "url": "https://www.reddit.com/r/MexicoCity/comments/1e2k5f3/should_i_stay_in_mexico_city_for_my_whole_3_week/",
    "score": 6,
    "created_utc": "2024-07-13T15:36:52",
    "subreddit": "MexicoCity",
    "text": "Hi all! Im a female solo traveller going to Mexico City for a Metallica concert in September. I haven't booked my flight home yet as I'm still figuring out my itinerary.\n\nMy predicament is - do I stay in Mexico city for the duration of my trip (3 weeks or so)? Part of me feels like, maybe since I'm flying across the world, I should explore more.\n\nHow I travel:\n\n* I usually avoid tourist attractions (I'll do one or two to tick them off so to speak)\n* I prefer being around and befriending locals\n*",
    "num_comments": 44
  },
  {
    "title": "Staying in Mexico City for 10 days",
    "url": "https://www.reddit.com/r/MexicoCity/comments/8hwipf/staying_in_mexico_city_for_10_days/",
    "score": 6,
    "created_utc": "2018-05-08T08:05:26",
    "subreddit": "MexicoCity",
    "text": "Starting Wednesday the 9th. Staying in La Condesa. Group of 6 with one person fluent in Spanish.\n\nWe're looking for food recommendations. Prefer cheap, hole in the wall hidden gen type places and STREET FOOD :)\n\nAlso looking for reccomendations on things to do. Good museums? The best way to see luchadores?\n\nLastly, we're thinking of spending a few days in the mountains. Would love any advice.\n\nThanks so much!\n",
    "num_comments": 9
  }
]